In [1]:
#DataFrames
import numpy as np
import pandas as pd

In [2]:
rows = ["ventas1", "ventas2", "ventas3"]
columns = ['zonaA', "zonaB", "zonaC"]
data = [ [130, 890, 378], [345, 541, 259], [890, 765, 345] ]

In [47]:
dataframe = pd.DataFrame(data, rows, columns)
dataframe

         zonaA  zonaB  zonaC
ventas1    130    890    378
ventas2    345    541    259
ventas3    890    765    345

In [4]:
dataframe.loc["ventas1"] #Seleccionar fila

zonaA    130
zonaB    890
zonaC    378
Name: ventas1, dtype: int64

In [24]:
dataframe.loc[["ventas1", "ventas2"]] #Seleccionar filas

         zonaA  zonaB  zonaC  Zonas
ventas1    130    890    378   1398
ventas2    345    541    259   1145

In [44]:
dataframe[["zonaA", "zonaC"]] #Seleccionar columnas

         zonaA  zonaC
ventas1    130    378
ventas2    345    259

In [16]:
dataframe.loc["ventas1"]["zonaC"] #Seleccionar un solo elemento

378

In [43]:
dataframe["Zonas"] = dataframe["zonaA"] + dataframe["zonaB"] +  dataframe["zonaC"] #AÃ±adir nueva columna
dataframe

         zonaA  zonaB  zonaC  Zonas
ventas1    130    890    378   1398
ventas2    345    541    259   1145

In [38]:
dataframe.drop("Zonas", axis = 1) #Borrar una columna. axis significa que es una columna

         zonaA  zonaB  zonaC
ventas1    130    890    378
ventas2    345    541    259
ventas3    890    765    345

In [39]:
dataframe.drop("Zonas", axis = 1, inplace = True) #Borrar definitivamente la columna
dataframe

         zonaA  zonaB  zonaC
ventas1    130    890    378
ventas2    345    541    259
ventas3    890    765    345

In [40]:
dataframe.drop("ventas3") #Eliminar fila

         zonaA  zonaB  zonaC
ventas1    130    890    378
ventas2    345    541    259

In [48]:
dataframe.drop("ventas3", inplace = True) #ELiminar fila definitivamente
dataframe

         zonaA  zonaB  zonaC
ventas1    130    890    378
ventas2    345    541    259

In [51]:
dataframe.shape #Ver el tamaÃ±o del dataframe

(2, 3)